src/sampleXmlData.xml

<!--SOAP REQUEST-->

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <RealTimePollRequest xmlns="http://www.whitespace-db-providers.org/2011//InterDB/ws">
      <RequestedTransactionID>1380634467190</RequestedTransactionID>
      <Command>wsdPoll</Command>
      <XsdVersion>1.2</XsdVersion>
    </RealTimePollRequest>
  </S:Body>
</S:Envelope>

<!--SOAP RESPONSE-->

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header/>
  <S:Body>
    <RealTimePollResponse xmlns="http://www.whitespace-db-providers.org/2011//InterDB/ws">
      <RequestedTransactionID>1380634467190</RequestedTransactionID>
      <Command>wsdPollResponse</Command>
      <RegistrationRecordEnsemble>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;RegistrationRecordEnsemble xmlns="http://www.whitespace-db-providers.org/2011//InterDB/xsd" xmlns:ns2="urn:ietf:params:xml:ns:vcard-4.0" xmlns:ns3="http://www.opengis.net/gml" xmlns:ns4="http://www.w3.org/1999/xlink" xmlns:ns5="urn:ietf:params:xml:ns:icalendar-2.0" xmlns:ns6="http://www.w3.org/2000/09/xmldsig#" xmlns:ns7="http://www.w3.org/2001/SMIL20/" xmlns:ns8="http://www.w3.org/2001/SMIL20/Language" version="1.2"&gt;
    &lt;EnsembleDescription&gt;
        &lt;Registrar&gt;KEYB&lt;/Registrar&gt;
        &lt;GenerationDate&gt;2013-10-01T14:34:28.811Z&lt;/GenerationDate&gt;
        &lt;Scope&gt;INC&lt;/Scope&gt;
        &lt;RecordsFrom&gt;2013-10-01T14:11:07.000Z&lt;/RecordsFrom&gt;
        &lt;RecordsTo&gt;2013-10-01T14:34:28.815Z&lt;/RecordsTo&gt;
    &lt;/EnsembleDescription&gt;
    &lt;Registration&gt;
        &lt;registrationType&gt;MVPD_Registration&lt;/registrationType&gt;
        &lt;MVPD_Registration&gt;
            &lt;RegistrationDisposition&gt;
                &lt;RegistrationDate&gt;2013-10-01T10:11:07.000-04:00&lt;/RegistrationDate&gt;
                &lt;RegID&gt;131001KEYB9223975&lt;/RegID&gt;
                &lt;Action&gt;1&lt;/Action&gt;
            &lt;/RegistrationDisposition&gt;
            &lt;mvpdRegistrant&gt;
                &lt;ns2:properties&gt;
                    &lt;ns2:org&gt;
                        &lt;ns2:parameters/&gt;
                        &lt;ns2:text&gt;KEYBRIDGE ID 1373385832624&lt;/ns2:text&gt;
                    &lt;/ns2:org&gt;
                &lt;/ns2:properties&gt;
            &lt;/mvpdRegistrant&gt;
            &lt;mvpdContact&gt;
                &lt;ns2:properties&gt;
                    &lt;ns2:org&gt;
                        &lt;ns2:parameters/&gt;
                        &lt;ns2:text&gt;Key Bridge Global LLC&lt;/ns2:text&gt;
                    &lt;/ns2:org&gt;
                    &lt;ns2:adr&gt;
                        &lt;ns2:parameters/&gt;
                        &lt;ns2:street&gt;
                            &lt;ns2:parameters/&gt;
                            &lt;ns2:text&gt;1600 Tysons Blvd. Suite 1100&lt;/ns2:text&gt;
                        &lt;/ns2:street&gt;
                        &lt;ns2:locality&gt;
                            &lt;ns2:parameters/&gt;
                            &lt;ns2:text&gt;McLean&lt;/ns2:text&gt;
                        &lt;/ns2:locality&gt;
                        &lt;ns2:region&gt;
                            &lt;ns2:parameters/&gt;
                            &lt;ns2:text&gt;VA&lt;/ns2:text&gt;
                        &lt;/ns2:region&gt;
                        &lt;ns2:code&gt;
                            &lt;ns2:parameters/&gt;
                            &lt;ns2:text&gt;22102&lt;/ns2:text&gt;
                        &lt;/ns2:code&gt;
                        &lt;ns2:country&gt;
                            &lt;ns2:parameters/&gt;
                            &lt;ns2:text/&gt;
                        &lt;/ns2:country&gt;
                    &lt;/ns2:adr&gt;
                    &lt;ns2:fn&gt;
                        &lt;ns2:parameters/&gt;
                        &lt;ns2:text&gt;KEYBRIDGE ID 1373385832624&lt;/ns2:text&gt;
                    &lt;/ns2:fn&gt;
                    &lt;ns2:email&gt;
                        &lt;ns2:parameters/&gt;
                        &lt;ns2:text&gt;contact+1373385832624@keybridgeglobal.com&lt;/ns2:text&gt;
                    &lt;/ns2:email&gt;
                    &lt;ns2:tel&gt;
                        &lt;ns2:parameters/&gt;
                        &lt;ns2:text&gt;+1 (703) 414-3500&lt;/ns2:text&gt;
                    &lt;/ns2:tel&gt;
                &lt;/ns2:properties&gt;
            &lt;/mvpdContact&gt;
            &lt;mvpdLocation&gt;
                &lt;locLatitude&gt;35.466399&lt;/locLatitude&gt;
                &lt;locLongitude&gt;-91.53125&lt;/locLongitude&gt;
                &lt;locDatum&gt;WGS_84&lt;/locDatum&gt;
                &lt;locRadiationCenter&gt;
                    &lt;rcAMSL&gt;162.0&lt;/rcAMSL&gt;
                    &lt;rcHAAT&gt;24.5&lt;/rcHAAT&gt;
                    &lt;rcHAG&gt;2.0&lt;/rcHAG&gt;
                &lt;/locRadiationCenter&gt;
            &lt;/mvpdLocation&gt;
            &lt;mvpdChannel&gt;
                &lt;ustChannel&gt;32&lt;/ustChannel&gt;
                &lt;ustCallSign&gt;KARK-TV&lt;/ustCallSign&gt;
            &lt;/mvpdChannel&gt;
            &lt;mvpdXmiterLocation&gt;
                &lt;locLatitude&gt;34.799257&lt;/locLatitude&gt;
                &lt;locLongitude&gt;-92.499882&lt;/locLongitude&gt;
                &lt;locDatum&gt;NAD_83&lt;/locDatum&gt;
                &lt;locRadiationCenter&gt;
                    &lt;rcAMSL&gt;602.0&lt;/rcAMSL&gt;
                    &lt;rcHAAT&gt;474.2&lt;/rcHAAT&gt;
                    &lt;rcHAG&gt;284.0&lt;/rcHAG&gt;
                &lt;/locRadiationCenter&gt;
            &lt;/mvpdXmiterLocation&gt;
        &lt;/MVPD_Registration&gt;
    &lt;/Registration&gt;
    &lt;NextTransactionID&gt;1380638068815&lt;/NextTransactionID&gt;
&lt;Signature xmlns="http://www.w3.org/2000/09/xmldsig#"&gt;&lt;SignedInfo&gt;&lt;CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/&gt;&lt;SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/&gt;&lt;Reference URI=""&gt;&lt;Transforms&gt;&lt;Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/&gt;&lt;/Transforms&gt;&lt;DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/&gt;&lt;DigestValue&gt;AcHhmOHm9F7nDOY5h9Dp4ZC3tO4=&lt;/DigestValue&gt;&lt;/Reference&gt;&lt;/SignedInfo&gt;&lt;SignatureValue&gt;cUdk+QMIlSTg1/VVafgVlmrr9KrVXuytTVg1g+vazy00C1en6m/NPy87yTcLA/1vE+aHAb7Q7hOY
        l7teA8J2Ax9ke7siP3/D+wLEqBFSZqvv7HfnVSJSjzyCJeINoBSVFHEX3lxaGlzg0k7sbRhKxIx1
        8etjStgXNm13DcUKLYHcX9t+G56WA/KLFok8RJPXFx938tvDMN+5SePh1XnOexdPqkRTxT1wuMv4
        6QVUdmNIEbA+xKWs7d0XWYi3Id2CBSN57dsl7JToYj6+suipL8O4Cm+NmxJO0HUK5FSPevG12uSR
        +AQMWI4fv8+Y9osCiVi2ad8UJ2Qt8jg7Q+mDbA==&lt;/SignatureValue&gt;&lt;KeyInfo&gt;&lt;KeyValue&gt;&lt;RSAKeyValue&gt;&lt;Modulus&gt;5CuJCADDZGn904zbXeELgqGCGDLwQWTxl/FXgyjOcBeXuu0U4qaG3SMzciutbfChJwbpRsMf9E2R
        K5jP4SQO37nWtHSaGW+77w074LcZ3beWbbaiULNr0hQtgm7g0syqbFWBM0FOHVE+W0jKmgPBU7YB
        TcX0/L+hdXJowanhdsHoJeMvLsqfcZ0OcXzt6LTIs+atrHwMKjOemuzMBO3I2IPdjH5rH3lbUu65
        1U3p+To5EcbJE7enGuCkj6gvggixLOwXsIAAM9l6ODVsVgHUSYJFjLK2iP+YhwoMerX8PXpteYzC
        7VtQRErnbVdiDTuFhFno1ocCv46x9sZoswSy1Q==&lt;/Modulus&gt;&lt;Exponent&gt;AQAB&lt;/Exponent&gt;&lt;/RSAKeyValue&gt;&lt;/KeyValue&gt;&lt;/KeyInfo&gt;&lt;/Signature&gt;&lt;/RegistrationRecordEnsemble&gt;
      </RegistrationRecordEnsemble>
      <XsdVersion>1.2</XsdVersion>
      <NextTransactionID>1380638070803</NextTransactionID>
      <RT-PollStatusCode>0</RT-PollStatusCode>
    </RealTimePollResponse>
  </S:Body>
</S:Envelope>
